# Tasks

#### 3: In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

#### 4: Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

#### 5: Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

#### 6: Confirm the results of the merge using the merge flag.

#### 7: Export the newly created dataframe as ords_prods_merge in a suitable format (taking into consideration the size).

#### 8: Ensure your notebooks and Instacart project folder are organized and that comments and section headings have been used throughout your code. All your exported data files should be effectively labeled and stored in your “Data” folder.

#### 9: Save the two notebooks and send them to your tutor along with a screenshot of the exported data sets in your Instacart project folder.

# Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# Importing Data

#### 3: In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

In [3]:
path = r'C:\Users\maxca\Instacart Basket Analysis'

In [4]:
# Checked Order Data
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [5]:
# New orders_product_prior.csv data set
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

# Checking both dataframes

#### 4: Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

In [11]:
# Checked Order Data
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,number_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

#### The Index got copied 2 times for some reason. There has to be a mistake in a prior step, which I will investigate later on. For now I will drop the excess columns.

#### -> After reading trough the PKL File Part I think this happened because exporting to csv creates the python index as it s own column. After re-loading it into Python there is the the false column and the new index of excel which ends in 3 Index Columns.

In [19]:
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [20]:
df_ords.head()

,Unnamed: 0.1,order_id,user_id,number_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [21]:
df_ords = df_ords.drop(columns = ['Unnamed: 0.1'])

In [22]:
df_ords.head()

,order_id,user_id,number_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [7]:
# New orders_product_prior.csv data
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

# Checking the Shape of both data frames

In [23]:
df_ords_prior.shape

(32434489, 4)

In [24]:
df_ords.shape

(3421083, 6)

# Merging both data frames

#### 5: Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [25]:
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [26]:
# Checking the merges data frame
df_merged_large.head()

,order_id,user_id,number_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

#### 6: Confirm the results of the merge using the merge flag.

In [28]:
# Checking for all the values that got sum up
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [31]:
# Checking the Shape
df_merged_large.shape

(32434489, 10)

# Exporting the new data frame

#### 7: Export the newly created dataframe as ords_prods_merge in a suitable format (taking into consideration the size).

In [ ]:
# Export data to csv

df_merged_large.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.csv'))

In [29]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))